# AddCorrectionFactor Method (Int64, Double) (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
TemperatureRatingType..::..AddCorrectionFactor Method (Int64, Double)
TemperatureRatingType Class See Also
---
Add a new electrical correction factor type to this temperature rating type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
[ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the AddCorrectionFactor(double, double) overload instead.")]
public CorrectionFactor AddCorrectionFactor(
	long temperature,
	double factor
)
```

Visual Basic
---
```text
<ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the AddCorrectionFactor(double, double) overload instead.")> _
Public Function AddCorrectionFactor ( _
	temperature As Long, _
	factor As Double _
) As CorrectionFactor
```

Visual C++
---
```text
[ObsoleteAttribute(L"This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the AddCorrectionFactor(double, double) overload instead.")]
public:
CorrectionFactor^ AddCorrectionFactor(
	long long temperature,
	double factor
)
```

# ### Parameters
temperature
    Type: System..::..Int64Temperature of correction factor to be added.
factor
    Type: System..::..DoubleFactor of correction factor to be added.
# ### Return Value
New constructed correction factor.
# See Also
TemperatureRatingType Class
AddCorrectionFactor Overload
Autodesk.Revit.DB.Electrical Namespace